const href = window.location.search;
const params = new URLSearchParams(href);
const { type: goto } = Object.fromEntries(Array.from(params.entries()));

const gotes =["gefgard","saghmosavanq","kecharis","tatev","khor-virap","sevanavanq","tegher","hagpat","aghavnavanq","hagharcin","dadivanq","zvartnoc","makaravanq","noravanq","aparam","artashat","chambarak","dilijna","gavar","goris","gyumri","jermuk-city","kapan","meghri","noyemberyan","sevan","sisiam","stepanavan","tsaghadzor","vanadzor","yerevan","amberd","areni","axtamar","cascade","garni","heruni","jermuk","lastiver","matenadar","noratus","parzlich","qarahoonj","qarer","tarer","tatev-tever","xndzoresk"];
const popUp = [
            {
                img : './ekekegheci/gefgard 1.png',
                text : 'Գեղարդի վանք (Գեղարդավանք, նաև Այրիվանք), միջնադարյան վանական համալիր Հայաստանում։ Գտնվում է Կոտայքի մարզի Գողթ գյուղի մոտ՝ Ազատ գետի վերին հոսանքում՝ աջ ափին։ Այստեղ է պահվել հայտնի գեղարդը, որովհռոմեացի զինվորը ծակել է Քրիստոսի կողը։ ',
                name : 'Գեղարդի վանք',
             },
             {
                img : './ekekegheci/saghmosavanq 1.png',
                text : 'Հայկական առաքելական վանական համալիր Հայաստանի Արագածոտնի մարզի Սաղմոսավան գյուղում։ Կառուցվել է 13-րդ դարում Այրարատյանկողմնակալության կողմնակալ Վաչե Ա Վաչուտյանի և իր իշխանական ընտանիքի կողմից։',
                name : 'Սաղմոսավանք',
             },
             {
                img : './ekekegheci/kecharis 1.png',
                text : 'Կեչառիսի վանական համալիր, Հայ Առաքելական Եկեղեցու Կոտայքի թեմիառաջնորդանիստ եկեղեցի Կոտայքի մարզի Ծաղկաձոր քաղաքի հյուսիսարևմուտքում՝ կառուցված 11-13-րդ դարերում, միջնադարյան Հայաստանինշանավոր կրոնական ու մշակութային կենտրոն։',
                name : 'Կեչառիս',
             },
             {
               img : './ekekegheci/tatev 1.png',
               text : 'Տաթևի վանք, միջնադարյան վանական համալիր Հայաստանում։ Գտնվում է Սյունիքի մարզի Տաթև գյուղի հարավում՝Որոտան գետի վտակի ձորի աջափնյա եզերքին։ Ավանդության համաձայն՝վանքը կոչվել է Թադեոս առաքյալի աշակերտ Եվստաթեոսի անունով։',
               name : 'Տաթևի վանք',
             },
             {
               img : './ekekegheci/khor-virap 1.png',
               text : 'Խոր վիրապի վանք, ճարտարապետականհուշարձան, 17-րդ դարի վանք-ամրոց Մեծ Հայքի Այրարատ նահանգի Ոստան Հայոց գավառում: Եղել է Հայոց հանրահայտ ուխտատեղիներից՝ կապված Գրիգոր Լուսավորչի անվան հետ։',
               name : "Խոր Վիրապ",
               },
            {
               img : './ekekegheci/sevanavanq 1.png',
               text : 'Սևանավանք, հայկական վանական համալիր Սևանի թերակղզու վրա, Գեղարքունիքի մարզ, Հայաստան։ Հիմնադրվել է 305 թվականին, երկու եկեղեցիները՝ 874 թվականին։ Սևանի վանքը գտնվում է Սևանի թերակղզում (նախկինում՝ կղզի), հիմնադրել է Գրիգոր ԱԼուսավորիչը 305 թվականին։',
               name : 'Սևանավանք',
            },
            {
               img : './ekekegheci/texer 1.png',
               text : 'Տեղերի վանք, հայ առաքելական վանական համալիր Հայաստանի Հանրապետության Արագածոտնի մարզիՏեղեր գյուղում։ Ընդգրկված է Տեղերի պատմության և մշակույթի անշարժ հուշարձանների ցանկում։',
               name : 'Տեղերի վանք',
            },
            {
               img : './ekekegheci/hagpat 1.png',
               text : 'Հաղպատ, միջնադարյան Հայաստանիհոգևոր, մշակութային և գիտաուսումնական խոշոր կենտրոն, վանքային համալիր։ Գտնվում է Հայաստանի Լոռու մարզի Հաղպատ գյուղի հարավարևելյան բարձրադիր մասում։  ',
               name : 'Հաղպատի վանք',
            },
            {
               img : './ekekegheci/aghavnavanq 1.png',
               text : 'Աղավնավանք, 12 - 13-րդ դարերի կիսավեր հայկական վանքային համալիր Հայաստանի Տավուշի մարզի համանուն գյուղում։ Գտնվում է Աղնաբաթ անտառամասում, որն առանձնանում է այստեղ աճող և բարձր գնահատվող կենի ծառատեսակով։',
               name : 'Աղավնավանք',
            },    
            {
               img : './ekekegheci/haxarcin 1.png',
               text : 'Հաղարծնի վանք, 10-րդ դարի հայկական վանական համալիր, Հայաստանի Տավուշի մարզում, Դիլիջան քաղաքից 18 կմ հեռավորության վրա։ Վանքը ծաղկունքէ ապրել 12-րդ դարի վերջին - 13-րդ դարի սկզբին՝ Խաչատուր Տարոնացու առաջնորդության ժամանակ:',
               name : 'Հաղարածին',
            },            
            {
               img : './ekekegheci/dadivanq 1.png',
               text : 'Դադիվանք (հայտնի է նաև Առաքելոց, Առաքելադիր անուններով), հայկական առաքելական միջնադարյան վանական համալիր Արցախի Հանրապետության Շահումյանի շրջանի Դադիվանք գյուղում՝Դադիվան լեռան լանջին՝ Թարթառ գետի ձախ ափին։ ',
               name : 'Դադիվանք',
            },   
            {
               img : './ekekegheci/zavrtnoc 1.png',
               text : '',
               name : 'Զվարթնոց',
            },
            {
               img : './ekekegheci/makaravanq 1.png',
               text : 'Մակարավանք, Ագռավավանք, 13-րդ դարի հայկական վանական համալիր ՀայաստանիՏավուշի մարզում, Աչաջուր գյուղից 3 կմ հարավ-արևմուտք, Պայտաթափ լեռան լանջին։ ',
               name : 'Մակարավանք',
               },
            {
               img : './ekekegheci/noravanq 1.png',
               text : 'Նորավանք (Ամաղու Նորավանք), Հայ առաքելական վանական համալիր, որը կառուցվել է 13-ից 14-րդ դարերում։ Գտնվում է Հայաստանի Հանրապետության Վայոց ձորի մարզում՝ Ամաղու գյուղից 3 կմ հյուսիս-արևելք։ ԸստՍտեփանոս Օրբելյանի՝ արդեն վաղ միջնադարից հանդիսացել է սրբատեղի։',
               name : 'Նորավանք',
            },
            {
               img : './cities/aparam 1.png',
               text : 'Ապարան, քաղաք Հայաստանի Արագածոտնի մարզի Ապարանի տարածաշրջանում։ Երևանից 59 կմ դեպի հյուսիս-արևմուտք՝ Քասաղի ավազանի վերին մասում՝ Ապարանի դաշտի հյուսիսարևմուտքում, 1880 մ բարձր։ Քաղաքը գտնվում է Երևան-Սպիտակ ավտոմայրուղու վրա։',
               name : 'Ապարան'
            },
            {
               img : './cities/artashat 1.png',
               text : 'Արտաշատ, քաղաք Հայաստանի Արարատի մարզում։ Գտնվում է Արաքս գետի ափին, Արարատյան դաշտում՝ Երևանից 30 կմ հարավարևելք։ Լինելով Հայաստանի չորրորդ մայրաքաղաքը, Արտաշատը ներկայումս Արարատի մարզի մարզկենտրոնն է։',
               name : 'Արտաշատ'
            },
            {
               img : './cities/chambarak 2.png',
               text : 'Ճամբարակ, քաղաք Հայաստանում, Գեղարքունիքի մարզի 5 քաղաքներից մեկը, մարզի հյուսիսարևելյան մասում, Հայաստանի արևելյան սահմանից 1 կմ հեռավորության վրա։ Լեռնային բնակավայր է, ծովի մակերևույթից միջինբարձրությունը 1860 մ է։',
               name : 'Ճամբարակ'
            },
            {
               img : './cities/dilijna.png',
               text : 'Դիլիջան, նախկինում անվանվել է նաև Դելիջան, հանգստավայրային և առողջարանային բնակավայր (քաղաքային համայնք) Հայաստանի Տավուշի մարզում, մարզկենտրոն Իջևանից 36 կմ հարավ-արևմուտք։ Գտնվում է Աղստևգետի ափին՝ ծովի մակերևույթից 1100-1510 մետր բարձրության վրա։',
               name : 'Դիլիջան'
            },
            {
               img : './cities/gavar 1.png',
               text : 'Գավառ, քաղաք Հայաստանում, Գեղարքունիքի մարզկենտրոնն է։ Գտնվում է Գեղամա լեռնաշղթայի արևելյան լանջին, Գավառագետի ստորին հոսանքի ավազանում։ Հեռավորությունը Երևանից 98 կմ է, Սևան երկաթուղային կայարանից՝ 36 կմ։',
               name : 'Գավառ'
            },
            {
               img : './cities/goris 1.png',
               text : 'Գորիս, քաղաք Սյունիքի մարզում, մոտ 240 կմ հեռավորության վրա մայրաքաղաք Երևանիցև 69 կմ հյուսիս-արևելք մարզկենտրոն Կապանից։ Գտնվում է Վարարակն գետի (Որոտանի վտակ) ափին։ Քաղաքը գտնվում է Երևան – Ստեփանակերտ ռազմավարական կարևորագույն նշանակություն ունեցող ճանապարհի վրա։',
               name : 'Գորիս'
            },
            {
               img : './cities/gyumri 1.png',
               text : 'Գյումրի , բնակչության քանակով ու մշակութային նշանակությամբ Հայաստանի երկրորդ քաղաքն է, գտնվում է հյուսիսարևմտյան մասում՝ Շիրակի մարզում,Ախուրյան գետի ձախ ափին, Երևանից 126 կմ հեռավորության վրա։ Տարածքը՝ 3626 հեկտար։',
               name : 'Գյումրի'
            },
            {
               img : './cities/jermuk-city 1.png',
               text : 'Ջերմուկ, քաղաք Հայաստանի Վայոց ձորի մարզում, մարզկենտրոնից 50 կմ հյուսիսարևելք, Արփա գետի ակունքի շրջանում։ Հայաստանի երեք առողջարանային քաղաքներից մեկն է։ Գտնվում է Երևանից 173 կմ հեռավորության վրա:',
               name : 'Ջերմուկ'
            },
            {
               img : './cities/kapan 1.png',
               text : 'Կապան (19-րդ դարի 50-ական թվականներից մինչև Հայաստանի անկախացում քաղաքը կոչվել է Ղափան), այն գտնվում է Հայաստանի Սյունիքի մարզում, ինչպես նաև հանդիսանումէ նրա մարզկենտրոն։ 2017թվականի նոյեմբերից, իր մեջ միավորելով տարածաշրջանի գյուղական համայնքները, դարձել է Կապան խոշորացված համայնք։ ',
               name : 'Կապան'
            },
            {
               img : './cities/meghri 1.png',
               text : 'Մեղրի, նախկինում կոչվել է նաև Կարճավան, քաղաք հարավային Հայաստանի Սյունիքի մարզի համանուն խոշորացված համայնքում՝ հայիրանական միջպետական սահմանին մոտ։ Ըստ 2020 թվականի մարդահամարիարդյունքների՝ Մեղրի քաղաքի բնակչությունը կազմում է 4500 մարդ։',
               name : 'Մեղրի'
            },
            {
               img : './cities/noyemberyan 1.png',
               text : 'Նոյեմբերյանը (հին անունը՝ Բարանա), քաղաք Հայաստանի Տավուշի մարզի հյուսիսում: Գտնվում է Երևանից 185 կմ հեռավորության վրա։ Քաղաքի մոտ հայադրբեջանական սահմանն է գտնվում։ Մոտակայքի գյուղերը Կողբը, Դովեղը և Ջուջևանն են։',
               name : 'Նոյեմբերյան'
            },
            {
               img : './cities/sevan 2.png',
               text : 'Սևանը քաղաք է Հայաստանի Գեղարքունիքի մարզում, Սևանա լճի հյուսիսարևմտյան ափին, մայրաքաղաքԵրևանից 66 կմ հյուսիս-արևելք և մարզկենտրոն Գավառից 35 կմ հյուսիս։',
               name : 'Սևան'
            },
            {
               img : './cities/sisiam 1.png',
               text : '',
               name : 'Սիսան'
            },
            {
               img : './cities/stepanavan 1.png',
               text : 'Ստեփանավան (նախկինում՝ Օրան-Լոռի, Կամենկա, Ջալալ-օղլի), քաղաք Հայաստանի Լոռու մարզում։ Անվանվել է Ստեփան Շահումյանի անունով։ 1954 թվականից քաղաքի վարչական տարածքի մեջ է մտնում Արմանիս գյուղը։',
               name : 'Ստեփանավան'
            },
            {
               img : './cities/tsaghadzor 1.png',
               text : 'Ծաղկաձոր (Կեչառիս, Ծաղկոցաձոր, մինչև 1947 թ.` Դարաչիչակ), քաղաք Հայաստանի Կոտայքի մարզում, Թեղենիսի արևելյան լանջին։ Կլիման մեղմ է, առողջարար։ Քաղաքը գտնվում է ծովի մակերևույթից 1841 մ բարձրության վրա, մարզկենտրոնից 6 կմ հյուսիս-արևմուտք։ Նախկինում գյուղն ամառանոցավայր էր, ապա՝ավան, 1958 թվականից՝ քաղաքատիպ ավան։',
               name : 'Ծաղկաձոր'
            },
            {
               img : './cities/vanadzor 1.png',
               text : 'Վանաձոր, խոշոր քաղաքային համայնքՀայաստանի հյուսիսում գտնվող Լոռու մարզում։ Այն հանդիսանում է Հայաստանի երրորդ խոշորագույն քաղաքը՝ մայրաքաղաք Երևանից և Գյումրուց հետո և Լոռու մարզի սոցիալտնտեսական, քաղաքական կենտրոնը։ ',
               name : 'Վանաձոր'
            },
            {
               img : './cities/yerevan 1.png',
               text :'Երևան քաղաք Հայաստանի արևմուտքում՝ Հրազդանի երկու ափերին։ Հանդիսանում է պետության մայրաքաղաքն ու խոշորագույնբնակավայրը, վարչաքաղաքական, տնտեսական կենտրոնը։',
               name :'Երևան'
            },
            {
               img : './tesrzanVayrer/amberd 1.png',
               text : 'Ամբերդ, Ամպիր, Անբերդ, Համբերդ, Հանբերդ, Ղըզղալա[3], միջնադարյան նախկին բերդաքաղաք և ամրոց։ Կառուցվել է 11-13-րդ դարերում, Արագած լեռան հարավային լանջին՝Բյուրական գյուղից 7 կմ հյուսիս։ Տեղադրված է եռանկյունաձև հրվանդանին, ծովի մակերևույթից 2300 մետր բարձրության վրա՝ Արքաշեն և Ամբերդ գետերի միացման տեղում։',
               name : 'Ամբերդ'
            },
            {
               img : './tesrzanVayrer/areni 1.png',
               text : 'Արենի գինու գործարանը, որը հիմնադրվելէ 1994 թվականին, տարածքում ամենահին և ամենահեղինակավոր գինու գործարաններից է: Գինեգործարանը 2012 թվականից սկսած ամեն տարի ընդունում է մոտ 30,000 հետաքրքրասեր (և ծարավ!) այցելու: ',
               name : 'Արենի'
            },            
            {
               img : './tesrzanVayrer/axtamar 1.png',
               text : 'Վանա լճի ներկայիս չորս կղզիներից ամենանշանավորն է։ Գտնվում է Վանա լճի հարավարևելյան մասում։ Կղզու անվանումը եկել է հին հայկական լեգենդի հերոս Թամարի անունից։ Այդ լեգենդի հիման վրա է հայ մեծանուն գրողՀովհաննես Թումանյանը գրել իր «Ախթամար» պոեմը։',
               name : 'Ախթամար'
            },            
            {
               img : './tesrzanVayrer/cascade 1.png',
               text : 'Կասկադ համալիր, ճարտարապետականկոթողային համալիր Երևանում։ Համալիրում գտնվում են ցուցասրահներ, շատրվաններ, ծաղկանոցներ և հարթաքանդակներ։ Համալիրի վերևում գտնվում է Հոկտեմբերյան հեղափոխության 50-ամյակին նվիրված հուշարձան (1967 թ.)։ ',
               name : 'Կասկադ համալիր'
            },           
             {
               img : './tesrzanVayrer/garni 1.png',
               text : 'Գառնու հեթանոսական տաճար, հին հայկական արևապաշտական տաճար Կոտայքի մարզի Գառնի գյուղում, Ազատգետի աջ ափին։ Հայաստանի պատմության և մշակույթի անշարժ հուշարձան է:',
               name : 'Գառնու տաճար'
            },            
            {
               img : './tesrzanVayrer/heruni 1.png',
               text : 'Համաշխարհային ռադիոօպտիկական աստղադիտակում առաջինը նախագծվել և կառուցվել է 1975-1985 թվականներին Ռադիոֆիզիկայի գիտահետազոտական ինստիտուտի (ՀՌԻ, Երևան, Հայաստան) կողմիցԱրագած լեռան վրա գտնվող ՀՌՀ Արագածի գիտական կենտրոնի (ՀԳԿ, 100 հա) տարածքում(100 հա): Հայաստան) 1700 մ բարձրության վրա։',
               name : 'Պարիս Հեռունի'
            },            
            {
               img : './tesrzanVayrer/jermuk 1.png',
               text : 'Ջերմուկ, քաղաք Հայաստանի Վայոց ձորի մարզում, մարզկենտրոնից 50 կմ հյուսիսարևելք, Արփա գետի ակունքի շրջանում։ Հայաստանի երեք առողջարանային քաղաքներից մեկն է։ Գտնվում է Երևանից173 կմ հեռավորության վրա։',
               name : 'Ջերմուկ'
            },            
            {
               img : './tesrzanVayrer/lastiver 1.png',
               text : 'Լաստիվերը գտնվում է Հայաստանի հյուսիս-արևելքում՝ Տավուշի մարզում, Ենոքավան գյուղի ծայրամասում: Պետք է Տավուշի խիտ անտառներով իջնել Խաչաղբյուր գետի կիրճը, որտեղ էլ գտնվում է այդ թաքնված գանձը: Իսկ արահետի վերջում մեր առջև կբացվի Լաստիվերի ջրվեժի գեցեցիկ տեսարանը:',
               name : 'Լաստիվեր'
            },            
            {
               img : './tesrzanVayrer/matenadar 1.png',
               text : 'Մատենադարան կամ Երևանի Մեսրոպ Մաշտոցի անվան Մատենադարան, հինձեռագրերի և փաստաթղթերի պահպանման և ուսումնասիրման կենտրոն, ձեռագրերի պահպանման աշխարհի ամենահարուստ կենտրոններից մեկը։ ',
               name : 'Մատենադարան'
            },            
            {
               img : './tesrzanVayrer/noratus 1.png',
               text : 'Նորատուս, գյուղ Հայաստանի Հանրապետության Գեղարքունիքի մարզիԳավառի տարածաշրջանում։ Նորատուս գյուղը հայտնի է նախ և առաջ իր խաչքարերի գերեզմանոցով, որտեղ կան 9-18-րդ դդ. թվագրվող բազմաթիվ խաչքարեր։',
               name : 'Նորատուս'
            },            
            {
               img : './tesrzanVayrer/parzlich 1.png',
               text : 'Հոսք ունեցող լիճ է։ Սնվում է աղբյուրներից։ Ունի 300մ երկարություն և 100մ լայնություն։ Միջին խորությունը 3 մ է, առավելագույնը 10 մ։Մակերեսը կազմում է 0.,027 կմ², ծավալը 83,8 հազար խորանարդ մետր։ Լիճն ունի սողանքաարգելափակոցային ծագում։ Զարգացած են սողանքային երևույթները։ Շրջապատված է անտառներով։',
               name : 'Պարզ լիճ'
            },            
            {
               img : './tesrzanVayrer/qarahoonj 1.png',
               text : 'Քարահունջ, նախապատմական մեգալիթյան կառույց, «Զորաց քարեր բնակատեղի» անունը կրող պատմամշակութային արգելոց և պետության կողմից պահպանվող հատուկ տարածք Հայաստանի Սյունիքի մարզի Սիսիան քաղաքի մոտ՝ Մ 2 ճանապարհի հարևանությամբ։ 2004 թվականին Հայաստանիկառավարության կողմից կառույցը ճանաչվել էորպես աստղադիտարան։ ',
               name : 'Քարահունջ'
            },           
            {
               img : './tesrzanVayrer/qarer 2.png',
               text : 'Քարերի սիմֆոնիա կամ «Բազալտե երգեհոն», բնական հուշարձան Ազատ գետի՝ Գառնի գյուղի տարածքում գտնվողավազանում։ Ընդգրկված է Հայաստանի բնության հուշարձանների ցանկում :',
               name : 'Քարերի Սիմֆոնիա'
            },            
            {
               img : './tesrzanVayrer/tarer 2.png',
               text : 'Հայոց այբուբենի հուշարձան, հուշարձանԱրագածոտնի մարզի Արտաշավան գյուղում, Արագած լեռան արևելյան լանջին։ ։Հուշարձանը կառուցվել է 2005 թվականին հայոց գրերի ստեղծման 1600- ամյակի առթիվ։',
               name : 'Տառերի Պուրակ'
            },            
            {
               img : './tesrzanVayrer/tatev-tever 1.png',
               text : 'Տաթևի թևեր (Տաթևեր), Հալիձորը և Տաթևիվանքը իրար հետ կապող ճոպանուղի Հայաստանում։ «Տաթևեր» ճոպանուղին գրանցվել է Գինեսի ռեկորդների գրքում ՝ որպես աշխարհի ամենաերկար հետադարձելի ճոպանուղի, որը շարժվումէ առանց կանգառի։',
               name : 'Տաթևի թևեր'
            },            
            {
               img : './tesrzanVayrer/xndzoresk 1.png',
               text : 'Խնձորեսկ, գյուղ Հայաստանի Սյունիքի մարզում։ Գտնվում է Գորիս Ստեփանակերտ մայրուղուց աջ, խոր ձորիզառիթափի լանջերին և սարահարթի վրա, որտեղից էլ ստացել է Խնձորեսկ անվանումը։ Գտնվում է մարզկենտրոնից 82 կմ հեռավորության վրա։',
               name : 'Խնձորեսք'
            }
            
         ]
window.onload = () => {
   const img = document.querySelector(".frame .pic");
   const header = document.querySelector(".textBoard h1");
   const text = document.querySelector(".textBoard p");
   const loadEl = () => {
      const indexPages = gotes.indexOf(goto);
      popUp.forEach((goto, i) => {
         if (indexPages === i){
         img.src = goto.img
         header.innerText = goto.name;
         text.innerHTML = goto.text;
         }
      }); 
   };  
     loadEl();
   }   
let indexPages = gotes.indexOf(goto);
function nextPage(){
    window.location = `./goto.html?type=${gotes[++indexPages]}`;
    console.log(gotes.length)
    if(indexPages > (gotes.length-1)){
        console.log(gotes.length)
        window.location = `./goto.html?type=${gotes[0]}`;
    }
}
function select(){
    window.location = 'index.html'
}
