const href = window.location.search;
const params = new URLSearchParams(href);
const {type: page} = Object.fromEntries(Array.from(params.entries()));
const allElementsWithClassPlace = document.getElementsByClassName('place')
const pages = ['mountains', 'churches', 'cities'];
let indexOfSelectedPage = pages.indexOf(page)

if(!pages.includes(page)){
    location.replace('file:///home/hayk/Desktop/project/puzzle/404.html')
}

const objectsOfPlacesAndImages = [
    [
        {
            nameOfPlace: 'Խնձորեսկ',
            img: '../imgs/xndzoresk.png',
            content: 'Խնձորեսկ, գյուղ Հայաստանի Սյունիքի մարզում։ Գտնվում է Գորիս Ստեփանակերտ մայրուղուց աջ, խոր ձորի զառիթափի լանջերին և սարահարթի վրա, որտեղից էլ ստացել է Խնձորեսկ անվանումը։ Գտնվում է մարզկենտրոնից 82 կմ հեռավորության վրա։'
        },
        {
            nameOfPlace: 'Ամբերդ',
            img:'../imgs/amberd.png',
            content: 'Ամբերդ, Ամպիր, Անբերդ, Համբերդ, Հանբերդ, Ղըզղալա[3], միջնադարյան նախկին բերդաքաղաք և ամրոց։ Կառուցվել է 11-13-րդ դարերում, Արագած լեռան հարավային լանջին՝ Բյուրական գյուղից 7 կմ հյուսիս։ Տեղադրված է եռանկյունաձև հրվանդանին, ծովի մակերևույթից 2300 մետր բարձրության վրա՝ Արքաշեն և Ամբերդ գետերի միացման տեղում։'
        },
        {
            nameOfPlace: "Արենի",
            img: '../imgs/areni.png',
            content: 'Արենի գինու գործարանը, որը հիմնադրվել է 1994 թվականին, տարածքում ամենահին և ամենահեղինակավոր գինու գործարաններից է: Գինեգործարանը 2012 թվականից սկսած ամեն տարի ընդունում է մոտ 30,000 հետաքրքրասեր (և ծարավ!) այցելու: '
        },
        {
            nameOfPlace: "Աղթամար",
            img: '../imgs/axtamar.png',
            content: 'Վանա լճի ներկայիս չորս կղզիներից ամենանշանավորն է։ Գտնվում է Վանա լճի հարավարևելյան մասում։ Կղզու անվանումը եկել է հին հայկական լեգենդի հերոս Թամարի անունից։ Այդ լեգենդի հիման վրա է հայ մեծանուն գրող Հովհաննես Թումանյանը գրել իր «Ախթամար» պոեմը։'
        },
        {
            nameOfPlace: 'Կասկադ Համալիր',
            img: '../imgs/cascade.png',
            content: 'Կասկադ համալիր, ճարտարապետական-կոթողային համալիր Երևանում։ Համալիրում գտնվում են ցուցասրահներ, շատրվաններ, ծաղկանոցներ և հարթաքանդակներ։ Համալիրի վերևում գտնվում է Հոկտեմբերյան հեղափոխության 50-ամյակին նվիրված հուշարձան (1967 թ.):'
        },
        {
            nameOfPlace: 'Գառնու Տաճար',
            img: '../imgs/garni.png',
            content: 'Գառնու հեթանոսական տաճար, հին հայկական արևապաշտական տաճար Կոտայքի մարզի Գառնի գյուղում, Ազատ գետի աջ ափին։ Հայաստանի պատմության և մշակույթի անշարժ հուշարձան է:'
        },
        {
            nameOfPlace: "Պարիս Հերունի",
            img: '../imgs/heruni.png',
            content: 'Համաշխարհային ռադիոօպտիկական աստղադիտակում առաջինը նախագծվել և կառուցվել է 1975-1985 թվականներին Ռադիոֆիզիկայի գիտահետազոտական ինստիտուտի (ՀՌԻ, Երևան, Հայաստան) կողմից Արագած լեռան վրա գտնվող ՀՌՀ Արագածի գիտական կենտրոնի (ՀԳԿ, 100 հա) տարածքում (100 հա): Հայաստան) 1700 մ բարձրության վրա։'
        },
        {
            nameOfPlace: "Ջերմուկ",
            img: '../imgs/jermuk.png',
            content: 'Ջերմուկ, քաղաք Հայաստանի Վայոց ձորի մարզում, մարզկենտրոնից 50 կմ հյուսիս-արևելք, Արփա գետի ակունքի շրջանում։ Հայաստանի երեք առողջարանային քաղաքներից մեկն է։ Գտնվում է Երևանից 173 կմ հեռավորության վրա[1]։'
        },
        {
            nameOfPlace: 'Լաստիվեր',
            img: '../imgs/lastiver.png',
            content: ''
        },
        {
            nameOfPlace: 'Մատենադարան',
            img: '../imgs/matenadaran.png',
            content: 'Մատենադարան կամ Երևանի Մեսրոպ Մաշտոցի անվան Մատենադարան, հին ձեռագրերի և փաստաթղթերի պահպանման և ուսումնասիրման կենտրոն, ձեռագրերի պահպանման աշխարհի ամենահարուստ կենտրոններից մեկը։ '
        },
        {
            nameOfPlace: "Նորատուս",
            img: '../imgs/noratus.png',
            content: 'Նորատուս, գյուղ Հայաստանի Հանրապետության Գեղարքունիքի մարզի Գավառի տարածաշրջանում։ Նորատուս գյուղը հայտնի է նախ և առաջ իր խաչքարերի գերեզմանոցով, որտեղ կան 9-18-րդ դդ. թվագրվող բազմաթիվ խաչքարեր։'
        },
        {
            nameOfPlace: "Պարզ Լիճ",
            img: '../imgs/parzlich.png',
            content: 'Հոսք ունեցող լիճ է։ Սնվում է աղբյուրներից։ Ունի 300մ երկարություն և 100մ լայնություն։ Միջին խորությունը 3 մ է, առավելագույնը 10 մ։ Մակերեսը կազմում է 0.,027 կմ², ծավալը 83,8 հազար խորանարդ մետր[2]։ Լիճն ունի սողանքաարգելափակոցային ծագում։ Զարգացած են սողանքային երևույթները։ Շրջապատված է անտառներով։'
        },
        {
            nameOfPlace: 'Քարահունջ',
            img: '../imgs/qarahunj.png',
            content: 'Քարահունջ, նախապատմական մեգալիթյան կառույց, «Զորաց քարեր բնակատեղի» անունը կրող պատմամշակութային արգելոց և պետության կողմից պահպանվող հատուկ տարածք Հայաստանի Սյունիքի մարզի Սիսիան քաղաքի մոտ՝ Մ 2 ճանապարհի հարևանությամբ։ 2004 թվականին Հայաստանի կառավարության կողմից կառույցը ճանաչվել է որպես աստղադիտարան։ '
        },
        {
            nameOfPlace: 'Քարերի Սիմֆոնիա',
            img: '../imgs/qarer.png',
            content: 'Քարերի սիմֆոնիա կամ «Բազալտե երգեհոն», բնական հուշարձան Ազատ գետի՝ Գառնի գյուղի տարածքում գտնվող ավազանում։ Ընդգրկված է Հայաստանի բնության հուշարձանների ցանկում '
        },
        {
            nameOfPlace: "Տառերի Պուրակ",
            img: '../imgs/tarer.png',
            content: 'Հայոց այբուբենի հուշարձան, հուշարձան Արագածոտնի մարզի Արտաշավան գյուղում, Արագած լեռան արևելյան լանջին։ ։Հուշարձանը կառուցվել է 2005 թվականին հայոց գրերի ստեղծման 1600-ամյակի առթիվ։'
        },
        {
            nameOfPlace: "Տաթևեր",
            img: '../imgs/tatev.png',
            content: 'Տաթևի թևեր (Տաթևեր), Հալիձորը և Տաթևի վանքը իրար հետ կապող ճոպանուղի Հայաստանում։ «Տաթևեր» ճոպանուղին գրանցվել է Գինեսի ռեկորդների գրքում ՝ որպես աշխարհի ամենաերկար հետադարձելի ճոպանուղի, որը շարժվում է առանց կանգառի։'
        }
    ],
    [
        {
            content: 'Աղավնավանք, 12 - 13-րդ դարերի կիսավեր հայկական վանքային համալիր Հայաստանի Տավուշի մարզի համանուն գյուղում։  Գտնվում է Աղնաբաթ անտառամասում, որն առանձնանում է այստեղ աճող և բարձր գնահատվող կենի ծառատեսակով։ կա։',
            nameOfPlace: 'Աղավնավանք',
            img: '../imgs/aghavnavanq.png'
        },
        {
            content: 'Դադիվանք (հայտնի է նաև Առաքելոց, Առաքելադիր անուններով[1]), հայկական առաքելական միջնադարյան վանական համալիր Արցախի Հանրապետության Շահումյանի շրջանի Դադիվանք գյուղում՝ Դադիվան լեռան լանջին՝ Թարթառ գետի ձախ ափին։',
            nameOfPlace: 'Դադիվանք',
            img:'../imgs/dadivanq.png'
        },
        {
            content: 'Գեղարդի վանք (Գեղարդավանք, նաև Այրիվանք), միջնադարյան վանական համալիր Հայաստանում։ Գտնվում է Կոտայքի մարզի Գողթ գյուղի մոտ՝ Ազատ գետի վերին հոսանքում՝ աջ ափին։ Այստեղ է պահվել հայտնի գեղարդը, որով հռոմեացի զինվորը ծակել է Քրիստոսի կողը։ ',
            nameOfPlace: "Գեղարդ",
            img:'../imgs/geghard.png'
        },
        {
            content: 'Հաղպատ, միջնադարյան Հայաստանի հոգևոր, մշակութային և գիտաուսումնական խոշոր կենտրոն, վանքային համալիր։ Գտնվում է Հայաստանի Լոռու մարզի Հաղպատ գյուղի հարավարևելյան բարձրադիր մասում։ ',
            nameOfPlace: "Հաղպատ",
            img:"../imgs/hagpat.png"
        },
        {
            content: 'Հաղարծնի վանք, 10-րդ դարի հայկական վանական համալիր, Հայաստանի Տավուշի մարզում, Դիլիջան քաղաքից 18 կմ հեռավորության վրա։ Վանքը ծաղկունք է ապրել 12-րդ դարի վերջին - 13-րդ դարի սկզբին՝ Խաչատուր Տարոնացու առաջնորդության ժամանակ:',
            nameOfPlace: 'Հաղարծնի Վանք',
            img: '../imgs/haxarcin.png'
        },
        {
            content: 'Կեչառիսի վանական համալիր, Հայ Առաքելական Եկեղեցու Կոտայքի թեմի առաջնորդանիստ եկեղեցի Կոտայքի մարզի Ծաղկաձոր քաղաքի հյուսիս-արևմուտքում՝ կառուցված 11-13-րդ դարերում, միջնադարյան Հայաստանի նշանավոր կրոնական ու մշակութային կենտրոն։ ',
            nameOfPlace: 'Կեչառիս',
            img: '../imgs/kecharis.png'
        },
        {
            content: 'Խոր վիրապի վանք, ճարտարապետական հուշարձան, 17-րդ դարի վանք-ամրոց Մեծ Հայքի Այրարատ նահանգի Ոստան Հայոց գավառում:  Եղել է Հայոց հանրահայտ ուխտատեղիներից՝ կապված Գրիգոր Լուսավորչի անվան հետ։',
            nameOfPlace: "Խոր Վիրապ",
            img: '../imgs/khor_virap.png'
        },
        {
            content: 'Մակարավանք[2], Ագռավավանք, 13-րդ դարի հայկական վանական համալիր Հայաստանի Տավուշի մարզում, Աչաջուր գյուղից 3 կմ հարավ-արևմուտք, Պայտաթափ լեռան լանջին։  ',
            nameOfPlace: "Մակարավանք",
            img: '../imgs/makaravanq.png'
        },
        {
            content: 'Նորավանք (Ամաղու Նորավանք), Հայ առաքելական վանական համալիր, որը կառուցվել է 13-ից 14-րդ դարերում։ Գտնվում է Հայաստանի Հանրապետության Վայոց ձորի մարզում՝ Ամաղու գյուղից 3 կմ հյուսիս-արևելք։ Ըստ Ստեփանոս Օրբելյանի՝ արդեն վաղ միջնադարից հանդիսացել է սրբատեղի։',
            nameOfPlace: 'Նորավանք',
            img: '../imgs/noravanq.png'
        },
        {
            content: 'հայկական առաքելական վանական համալիր Հայաստանի Արագածոտնի մարզի Սաղմոսավան գյուղում[2]։ Կառուցվել է 13-րդ դարում Այրարատյան կողմնակալության կողմնակալ Վաչե Ա Վաչուտյանի և իր իշխանական ընտանիքի կողմից։',
            nameOfPlace: 'Սաղմոսավանք',
            img: '../imgs/saghmosavanq.png'
        },
        {
            content: 'Սանահինի վանքային համալիր, միջնադարյան հոգևոր, մշակութային և գիտակրթական նշանավոր կենտրոն Մեծ Հայքի Գուգարք նահանգի Տաշիրք գավառում, այժմ՝ Հայաստանի Լոռու մարզի Ալավերդի քաղաքի Սանահին թաղամասում (նախկին Սանահին գյուղ), Դեբեդ գետի աջափնյա բարձրադիր սարավանդի վրա։',
            nameOfPlace: "Սանահին",
            img: '../imgs/sanahin.png'
        },
        {
            content: "Սևանավանք, հայկական վանական համալիր Սևանի թերակղզու վրա, Գեղարքունիքի մարզ, Հայաստան։ Հիմնադրվել է 305 թվականին, երկու եկեղեցիները՝ 874 թվականին։ Սևանի վանքը գտնվում է Սևանի թերակղզում (նախկինում՝ կղզի), հիմնադրել է Գրիգոր Ա Լուսավորիչը 305 թվականին։",
            nameOfPlace: "Սեվանավանք",
            img: '../imgs/sevanavanq.png'
        },
        {
            content: 'Տաթևի վանք, միջնադարյան վանական համալիր Հայաստանում։ Գտնվում է Սյունիքի մարզի Տաթև գյուղի հարավում՝ Որոտան գետի վտակի ձորի աջափնյա եզերքին։ Ավանդության համաձայն՝ վանքը կոչվել է Թադեոս առաքյալի աշակերտ Եվստաթեոսի անունով։',
            nameOfPlace: 'Տաթև',
            img: '../imgs/tatev.jpg'
        },
        {
            content: 'Տեղերի վանք, հայ առաքելական վանական համալիր Հայաստանի Հանրապետության Արագածոտնի մարզի Տեղեր գյուղում։ Ընդգրկված է Տեղերի պատմության և մշակույթի անշարժ հուշարձանների ցանկում։',
            nameOfPlace: 'Տեղերի Վանք',
            img: '../imgs/tegher.jpg'
        },
        {
            content: 'Հաղարծնի վանք, 10-րդ դարի հայկական վանական համալիր, Հայաստանի Տավուշի մարզում, Դիլիջան քաղաքից 18 կմ հեռավորության վրա։ Վանքը ծաղկունք է ապրել 12-րդ դարի վերջին - 13-րդ դարի սկզբին՝ Խաչատուր Տարոնացու առաջնորդության ժամանակ:',
            nameOfPlace: "Զվարթնոց",
            img: '../imgs/zvartnoc.png'
        },
        {
            content: 'Գնդեվանք, միջնադարյան եկեղեցական համալիր։ Գտնվում է Վայոց ձորի մարզի Գնդեվազ գյուղից դեպի արևմուտք, Արփա գետի ձախ ափին։ Կառուցվել է 931-938 թվականներին, Սյունյաց իշխանաց իշխան Սմբատի կնոջ՝ Սոփի (Սոփիա) իշխանուհու աջակցությամբ:',
            nameOfPlace: "Գնդեվանք",
            img: '../imgs/gndevank.jpg'
        }
    ],
    [
        {
            content: 'Ապարան, քաղաք Հայաստանի Արագածոտնի մարզի Ապարանի տարածաշրջանում։ Երևանից 59 կմ դեպի հյուսիս-արևմուտք՝ Քասաղի ավազանի վերին մասում՝ Ապարանի դաշտի հյուսիս-արևմուտքում, 1880 մ բարձր։ Քաղաքը գտնվում է Երևան-Սպիտակ ավտոմայրուղու վրա։',
            nameOfPlace: 'Ապարան',
            img: '../imgs/aparan.png'
        },
        {
            content: 'Արտաշատ, քաղաք Հայաստանի Արարատի մարզում։ Գտնվում է Արաքս գետի ափին, Արարատյան դաշտում՝ Երևանից 30 կմ հարավ-արևելք։ Լինելով Հայաստանի չորրորդ մայրաքաղաքը, Արտաշատը ներկայումս Արարատի մարզի մարզկենտրոնն է։ ',
            nameOfPlace: 'Արտաշատ',
            img:'../imgs/artashat.png'
        },
        {
            content: 'Ճամբարակ, քաղաք Հայաստանում, Գեղարքունիքի մարզի 5 քաղաքներից մեկը, մարզի հյուսիսարևելյան մասում, Հայաստանի արևելյան սահմանից 1 կմ հեռավորության վրա։ Լեռնային բնակավայր է, ծովի մակերևույթից միջին բարձրությունը 1860 մ է։ ',
            nameOfPlace: "Ճամբարակ",
            img:'../imgs/chambarak.png'
        },
        {
            content: 'Գավառ, քաղաք Հայաստանում, Գեղարքունիքի մարզկենտրոնն է։ Գտնվում է Գեղամա լեռնաշղթայի արևելյան լանջին, Գավառագետի ստորին հոսանքի ավազանում։ Հեռավորությունը Երևանից 98 կմ է, Սևան երկաթուղային կայարանից՝ 36 կմ։',
            nameOfPlace: "Գավառ",
            img:"../imgs/gavar.png"
        },
        {
            content: 'Ջերմուկ, քաղաք Հայաստանի Վայոց ձորի մարզում, մարզկենտրոնից 50 կմ հյուսիս-արևելք, Արփա գետի ակունքի շրջանում։ Հայաստանի երեք առողջարանային քաղաքներից մեկն է։ Գտնվում է Երևանից 173 կմ հեռավորության վրա:',
            nameOfPlace: 'Ջերմուկ',
            img: '../imgs/jermuk.png'
        },
        {
            content: 'Կապան (19-րդ դարի 50-ական թվականներից մինչև Հայաստանի անկախացում քաղաքը կոչվել է Ղափան), այն գտնվում է Հայաստանի Սյունիքի մարզում, ինչպես նաև հանդիսանում է նրա մարզկենտրոն։ 2017թվականի նոյեմբերից, իր մեջ միավորելով տարածաշրջանի գյուղական համայնքները, դարձել է Կապան խոշորացված համայնք։ ',
            nameOfPlace: 'Կապան',
            img: '../imgs/kapan.png'
        },
        {
            content: 'Մեղրի, նախկինում կոչվել է նաև Կարճավան, քաղաք հարավային Հայաստանի Սյունիքի մարզի համանուն խոշորացված համայնքում՝ հայ-իրանական միջպետական սահմանին մոտ։ Ըստ 2020 թվականի մարդահամարի արդյունքների՝ Մեղրի քաղաքի բնակչությունը կազմում է 4500 մարդ։',
            nameOfPlace: "Մեղրի",
            img: '../imgs/meghri.png'
        },
        {
            content: 'Նոյեմբերյանը (հին անունը՝ Բարանա), քաղաք Հայաստանի Տավուշի մարզի հյուսիսում: Գտնվում է Երևանից 185 կմ հեռավորության վրա։ Քաղաքի մոտ հայ-ադրբեջանական սահմանն է գտնվում։ Մոտակայքի գյուղերը Կողբը, Դովեղը և Ջուջևանն են։',
            nameOfPlace: "Նոյեմբերյան",
            img: '../imgs/noyemberyan.png'
        },
        {
            content: 'Գորիս, քաղաք Սյունիքի մարզում, մոտ 240 կմ հեռավորության վրա մայրաքաղաք Երևանից և 69 կմ հյուսիս-արևելք մարզկենտրոն Կապանից։ Գտնվում է Վարարակն գետի (Որոտանի վտակ) ափին։ Քաղաքը գտնվում է Երևան – Ստեփանակերտ ռազմավարական կարևորագույն նշանակություն ունեցող ճանապարհի վրա։',
            nameOfPlace: 'Գորիս',
            img: '../imgs/goris.png'
        },
        {
            content: 'Ստեփանավան (նախկինում՝ Օրան-Լոռի, Կամենկա, Ջալալ-օղլի), քաղաք Հայաստանի Լոռու մարզում։ Անվանվել է Ստեփան Շահումյանի անունով։ 1954 թվականից քաղաքի վարչական տարածքի մեջ է մտնում Արմանիս գյուղը։',
            nameOfPlace: 'Ստեփանավան',
            img: '../imgs/stepanavan.png'
        },
        {
            content: 'Ծաղկաձոր (Կեչառիս, Ծաղկոցաձոր, մինչև 1947 թ.՝ Դարաչիչակ), քաղաք Հայաստանի Կոտայքի մարզում, Թեղենիսի արևելյան լանջին։ Կլիման մեղմ է, առողջարար։ Քաղաքը գտնվում է ծովի մակերևույթից 1841 մ բարձրության վրա, մարզկենտրոնից 6 կմ հյուսիս-արևմուտք։ Նախկինում գյուղն ամառանոցավայր էր, ապա՝ ավան, 1958 թվականից՝ քաղաքատիպ ավան։',
            nameOfPlace: "Ծախկաձոր",
            img: '../imgs/tsaxkadzor.png'
        },
        {
            content: 'Վանաձոր, խոշոր քաղաքային համայնք Հայաստանի հյուսիսում գտնվող Լոռու մարզում։ Այն հանդիսանում է Հայաստանի երրորդ խոշորագույն քաղաքը՝ մայրաքաղաք Երևանից և Գյումրուց հետո և Լոռու մարզի սոցիալ-տնտեսական, քաղաքական կենտրոնը։ ',
            nameOfPlace: "Վանաձոր",
            img: '../imgs/vanadzor.png'
        },
        {
            content: 'Երևան քաղաք Հայաստանի արևմուտքում՝ Հրազդանի երկու ափերին։ Հանդիսանում է պետության մայրաքաղաքն ու խոշորագույն բնակավայրը, վարչաքաղաքական, տնտեսական կենտրոնը։ ',
            nameOfPlace: 'Երևան',
            img: '../imgs/yerevan.png'
        },
        {
            content: 'Գյումրի , բնակչության քանակով ու մշակութային նշանակությամբ Հայաստանի երկրորդ քաղաքն է, գտնվում է հյուսիսարևմտյան մասում՝ Շիրակի մարզում, Ախուրյան գետի ձախ ափին, Երևանից 126 կմ հեռավորության վրա։ Տարածքը՝ 3626 հեկտար։ ',
            nameOfPlace: 'Գյումրի',
            img: '../imgs/gyumri.jpg'
        },
        {
            content: 'Սևանը քաղաք է Հայաստանի Գեղարքունիքի մարզում, Սևանա լճի հյուսիսարևմտյան ափին, մայրաքաղաք Երևանից 66 կմ հյուսիս-արևելք և մարզկենտրոն Գավառից 35 կմ հյուսիս։',
            nameOfPlace: "Սևան",
            img: '../imgs/sevan.png'
        },
        {
            content: 'Դիլիջան, նախկինում անվանվել է նաև Դելիջան, հանգստավայրային և առողջարանային բնակավայր (քաղաքային համայնք) Հայաստանի Տավուշի մարզում, մարզկենտրոն Իջևանից 36 կմ հարավ-արևմուտք։ Գտնվում է Աղստև գետի ափին՝ ծովի մակերևույթից 1100-1510 մետր բարձրության վրա։',
            nameOfPlace: "Դիլիջան",
            img: '../imgs/dilijan.png'
        }
    ]
]

const backToMainPage = () => {
    window.location.replace(`../index.html`)
}

function addPlacements() {
    let j = pages.indexOf(page);
    for(let i = 0; i < objectsOfPlacesAndImages[j].length; i++) {
        const image = document.createElement('img');
        const place = document.createElement('div');
        const placeName = document.createElement('div');

        image.src = objectsOfPlacesAndImages[j][i]['img']
        image.classList.add('picture')
        place.classList.add('place');
        place.appendChild(image);
        placeName.classList.add('placeName');
        placeName.textContent = objectsOfPlacesAndImages[j][i]['nameOfPlace']
        place.appendChild(placeName);
        document.querySelector('.container').append(place);
    }
}

function setBackgroundPic() {
    const backgrounds = {
        mountains: './../imgs/backgroundForTesarjanVayrer.png',
        church: './../imgs/backgroundForChurches.svg',
        city: './../imgs/backgroundForCities.png' 
    }
    let picture = document.createElement('img');
    picture.classList.add('fix')
    document.body.appendChild(picture)
    if (indexOfSelectedPage === 0) {
        picture.src = backgrounds['mountains']
    } else if (indexOfSelectedPage === 1) {
        picture.src = backgrounds['church']
    } else if (indexOfSelectedPage === 2) {
        picture.src = backgrounds['city']
    }
}

function givePlacesOnclickFunction() {
    for (let i = 0; i < allElementsWithClassPlace.length; i++) {
        allElementsWithClassPlace[i].onclick = function() {
            localStorage.setItem('selectedPuzzle', JSON.stringify({...{index: i}, ...objectsOfPlacesAndImages[indexOfSelectedPage][i]}))
            window.location.replace("../puzzle_thirdPage/puzzle_game.html")
        }
    }
}

window.onload = function () {
    addPlacements();
    setBackgroundPic();
    givePlacesOnclickFunction()
}
